Port Security
-------------
0. All computers can connect togerther, then delete link of 10.0.1.1 and 10.0.1.3
1. Secured with a single PC via MAC address

Switch>enable 
Switch#configure 
Configuring from terminal, memory, or network [terminal]? 
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#interface fastEthernet 0/10
Switch(config-if)#switchport mode access 
Switch(config-if)#switchport port-security 
Switch(config-if)#switchport port-security mac-address 000C.CF9A.9EE8 <--  change this mac address as your PC0
Switch(config-if)#no shutdown 
Switch(config-if)#end

2. Show port status
Switch#show port-security interface fastEthernet 0/10
Port Security              : Enabled
Port Status                : Secure-down
Violation Mode             : Shutdown
Aging Time                 : 0 mins
Aging Type                 : Absolute
SecureStatic Address Aging : Disabled
Maximum MAC Addresses      : 1
Total MAC Addresses        : 1
Configured MAC Addresses   : 1
Sticky MAC Addresses       : 0
Last Source Address:Vlan   : 0000.0000.0000:0
Security Violation Count   : 0

3. Connect 10.0.1.3 to Switch ast port fast0/10
Ping 10.0.1.2 from 10.0.1.3, then show port status

Switch#
%LINK-5-CHANGED: Interface FastEthernet0/10, changed state to administratively down
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/10, changed state to down
Switch#sh port-security interface fastEthernet 0/10
Port Security              : Enabled
Port Status                : Secure-shutdown  <-----
Violation Mode             : Shutdown
Aging Time                 : 0 mins
Aging Type                 : Absolute
SecureStatic Address Aging : Disabled
Maximum MAC Addresses      : 1
Total MAC Addresses        : 1
Configured MAC Addresses   : 1
Sticky MAC Addresses       : 0
Last Source Address:Vlan   : 0009.7C22.E59E:1
Security Violation Count   : 1

4. Connect 10.0.1.1 to port fast0/10 and ping to 10.0.1.2, then show status

5. Reset port status in fast0/10
Switch(config)#interface fastEthernet 0/10
Switch(config-if)#no shutdown 
Switch(config-if)#exit
Switch(config)#exit

Switch#sh port-security interface fastEthernet 0/10
Port Security              : Enabled
Port Status                : Secure-up
Violation Mode             : Shutdown
Aging Time                 : 0 mins
Aging Type                 : Absolute
SecureStatic Address Aging : Disabled
Maximum MAC Addresses      : 1
Total MAC Addresses        : 1
Configured MAC Addresses   : 1
Sticky MAC Addresses       : 0
Last Source Address:Vlan   : 0009.7C22.E59E:1
Security Violation Count   : 0

Wait a few minitues, 
Switch#sh port-security interface fastEthernet 0/10
Port Security              : Enabled
Port Status                : Secure-up
Violation Mode             : Shutdown
Aging Time                 : 0 mins
Aging Type                 : Absolute
SecureStatic Address Aging : Disabled
Maximum MAC Addresses      : 1
Total MAC Addresses        : 1
Configured MAC Addresses   : 1
Sticky MAC Addresses       : 0
Last Source Address:Vlan   : 000C.CF9A.9EE8:1
Security Violation Count   : 0


5. Secured with the first conneted PC at port fast0/11

Switch>ena
Switch#configure 
Configuring from terminal, memory, or network [terminal]? 
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#interface fastEthernet 0/11
Switch(config-if)#switchport mode access 
Switch(config-if)#switchport port-security 
Switch(config-if)#switchport port-security mac-address sticky 
Switch(config-if)#end
Switch#

6. Show port security Status
Switch#show port-security interface fastEthernet 0/11
Port Security              : Enabled
Port Status                : Secure-down
Violation Mode             : Shutdown
Aging Time                 : 0 mins
Aging Type                 : Absolute
SecureStatic Address Aging : Disabled
Maximum MAC Addresses      : 1
Total MAC Addresses        : 0
Configured MAC Addresses   : 0
Sticky MAC Addresses       : 0
Last Source Address:Vlan   : 0000.0000.0000:0
Security Violation Count   : 0

7. Connect 10.0.2.3 to port fast 0/11, then ping to 10.0.2.2
Switch#show port-security interface fastEthernet 0/11
Port Security              : Enabled
Port Status                : Secure-up
Violation Mode             : Shutdown
Aging Time                 : 0 mins
Aging Type                 : Absolute
SecureStatic Address Aging : Disabled
Maximum MAC Addresses      : 1
Total MAC Addresses        : 1
Configured MAC Addresses   : 0
Sticky MAC Addresses       : 1
Last Source Address:Vlan   : 0009.7C22.E59E:1
Security Violation Count   : 0

8. Let 10.0.2.1 connect to fast0/11, and ping to 10.0.2.2
Switch#show port-security interface fastEthernet 0/11
Port Security              : Enabled
Port Status                : Secure-up
Violation Mode             : Shutdown
Aging Time                 : 0 mins
Aging Type                 : Absolute
SecureStatic Address Aging : Disabled
Maximum MAC Addresses      : 1
Total MAC Addresses        : 1
Configured MAC Addresses   : 0
Sticky MAC Addresses       : 1
Last Source Address:Vlan   : 0009.7C22.E59E:1
Security Violation Count   : 0

9. Reset port interface fast0/11
10. Port security can be change the violaion to protect/restict/shutdown(default)

Switch#configure 
Configuring from terminal, memory, or network [terminal]? 
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#interface fastEthernet 0/11
Switch(config-if)#switchport port-security violation ?
  protect   Security violation protect mode
  restrict  Security violation restrict mode
  shutdown  Security violation shutdown mode
Switch(config-if)#switchport port-security violation protect 

